In [1]:
import pandas as pd

In [2]:
stackoverflow = pd.read_csv('../Data/stackoverflow.csv')
stackoverflow.head()

,SurveyDate,FormalEducation,ConvertedSalary,Hobby,Country,StackOverflowJobsRecommend,VersionControl,Age,Years Experience,Gender,RawSalary
0,2/28/18 20:20,Bachelor's degree (BA. BS. B.Eng.. etc.),NaN,Yes,South Africa,NaN,Git,21,13,Male,NaN
1,6/28/18 13:26,Bachelor's degree (BA. BS. B.Eng.. etc.),70841.0,Yes,Sweeden,7.0,Git;Subversion,38,9,Male,"70,841.00"
2,6/6/18 3:37,Bachelor's degree (BA. BS. B.Eng.. etc.),NaN,No,Sweeden,8.0,Git,45,11,NaN,NaN
3,5/9/18 1:06,Some college/university study without earning ...,21426.0,Yes,Sweeden,NaN,Zip file back-ups,46,12,Male,"21,426.00"
4,4/12/18 22:41,Bachelor's degree (BA. BS. B.Eng.. etc.),41671.0,Yes,UK,8.0,Git,39,7,Male,"£41,671.00"

In [3]:
stackoverflow.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999 entries, 0 to 998
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   SurveyDate                  999 non-null    object
 1   FormalEducation             999 non-null    object
 2   ConvertedSalary             665 non-null    float64
 3   Hobby                       999 non-null    object
 4   Country                     999 non-null    object
 5   StackOverflowJobsRecommend  487 non-null    float64
 6   VersionControl              999 non-null    object
 7   Age                         999 non-null    int64
 8   Years Experience            999 non-null    int64
 9   Gender                      693 non-null    object
 10  RawSalary                   665 non-null    object
dtypes: float64(2), int64(2), object(7)
memory usage: 86.0+ KB

In [4]:
stackoverflow.dtypes

SurveyDate                     object
FormalEducation                object
ConvertedSalary               float64
Hobby                          object
Country                        object
StackOverflowJobsRecommend    float64
VersionControl                 object
Age                             int64
Years Experience                int64
Gender                         object
RawSalary                      object
dtype: object

In [6]:
stackoverflow.select_dtypes(include='int64').head()

   Age  Years Experience
0   21                13
1   38                 9
2   45                11
3   46                12
4   39                 7

In [12]:
stackoverflow.select_dtypes(include=['int64','float64']).head()

   ConvertedSalary  StackOverflowJobsRecommend  Age  Years Experience
0              NaN                         NaN   21                13
1          70841.0                         7.0   38                 9
2              NaN                         8.0   45                11
3          21426.0                         NaN   46                12
4          41671.0                         8.0   39                 7

In [7]:
stackoverflow['SurveyDate'].head(2)

0    2/28/18 20:20
1    6/28/18 13:26
Name: SurveyDate, dtype: object

In [8]:
stackoverflow['SurveyDate'].dtypes

dtype('O')

In [9]:
stackoverflow['SurveyDate'] = pd.to_datetime(stackoverflow['SurveyDate'])
stackoverflow['SurveyDate'].dtypes

dtype('<M8[ns]')

In [10]:
stackoverflow['SurveyDate'].head(2)

0   2018-02-28 20:20:00
1   2018-06-28 13:26:00
Name: SurveyDate, dtype: datetime64[ns]

### How to handle categorical data ?

In [13]:
oh = pd.get_dummies(stackoverflow, columns=['Country'], prefix='OH')
oh.head(2)

,SurveyDate,FormalEducation,ConvertedSalary,Hobby,StackOverflowJobsRecommend,VersionControl,Age,Years Experience,Gender,RawSalary,OH_France,OH_India,OH_Ireland,OH_Russia,OH_South Africa,OH_Spain,OH_Sweeden,OH_UK,OH_USA,OH_Ukraine
0,2018-02-28 20:20:00,Bachelor's degree (BA. BS. B.Eng.. etc.),NaN,Yes,NaN,Git,21,13,Male,NaN,0,0,0,0,1,0,0,0,0,0
1,2018-06-28 13:26:00,Bachelor's degree (BA. BS. B.Eng.. etc.),70841.0,Yes,7.0,Git;Subversion,38,9,Male,"70,841.00",0,0,0,0,0,0,1,0,0,0

In [15]:
oh_d = pd.get_dummies(stackoverflow, columns=['Country'], prefix='OH',drop_first=True)
oh_d.head(2)

,SurveyDate,FormalEducation,ConvertedSalary,Hobby,StackOverflowJobsRecommend,VersionControl,Age,Years Experience,Gender,RawSalary,OH_India,OH_Ireland,OH_Russia,OH_South Africa,OH_Spain,OH_Sweeden,OH_UK,OH_USA,OH_Ukraine
0,2018-02-28 20:20:00,Bachelor's degree (BA. BS. B.Eng.. etc.),NaN,Yes,NaN,Git,21,13,Male,NaN,0,0,0,1,0,0,0,0,0
1,2018-06-28 13:26:00,Bachelor's degree (BA. BS. B.Eng.. etc.),70841.0,Yes,7.0,Git;Subversion,38,9,Male,"70,841.00",0,0,0,0,0,1,0,0,0

In [20]:
country = stackoverflow['Country']

count = country.value_counts()
count

South Africa    166
USA             164
Spain           134
Sweeden         119
France          115
Russia           97
India            95
UK               95
Ukraine           9
Ireland           5
Name: Country, dtype: int64

In [21]:
get_index = country.isin(count[count < 10].index)
get_index.head()

0    False
1    False
2    False
3    False
4    False
Name: Country, dtype: bool

In [22]:
country[get_index] = 'Others'

<ipython-input-22-fcf4e8546c56>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  country[get_index] = 'Others'

In [23]:
country.value_counts()

South Africa    166
USA             164
Spain           134
Sweeden         119
France          115
Russia           97
India            95
UK               95
Others           14
Name: Country, dtype: int64

### How to deal with numerical values ?

In [24]:
stackoverflow.head(2)

,SurveyDate,FormalEducation,ConvertedSalary,Hobby,Country,StackOverflowJobsRecommend,VersionControl,Age,Years Experience,Gender,RawSalary
0,2018-02-28 20:20:00,Bachelor's degree (BA. BS. B.Eng.. etc.),NaN,Yes,South Africa,NaN,Git,21,13,Male,NaN
1,2018-06-28 13:26:00,Bachelor's degree (BA. BS. B.Eng.. etc.),70841.0,Yes,Sweeden,7.0,Git;Subversion,38,9,Male,"70,841.00"

In [25]:
stackoverflow['PaidJob'] = 0
stackoverflow.loc[stackoverflow['ConvertedSalary'] > 0, 'PaidJob'] = 1
stackoverflow[['ConvertedSalary','PaidJob']].head()

   ConvertedSalary  PaidJob
0              NaN        0
1          70841.0        1
2              NaN        0
3          21426.0        1
4          41671.0        1

<h3><a href="https://stackoverflow.com/questions/30211923/what-is-the-difference-between-pandas-qcut-and-pandas-cut">Pandas cut vs qcut</a></h3>

In [46]:
tryit = pd.Series([i for i in range(1,60)])
tryit.describe()

count    59.000000
mean     30.000000
std      17.175564
min       1.000000
25%      15.500000
50%      30.000000
75%      44.500000
max      59.000000
dtype: float64

In [47]:
pd.cut(tryit,5).value_counts()

(47.4, 59.0]     12
(35.8, 47.4]     12
(12.6, 24.2]     12
(0.942, 12.6]    12
(24.2, 35.8]     11
dtype: int64

In [48]:
pd.qcut(tryit,5).value_counts()

(47.4, 59.0]     12
(35.8, 47.4]     12
(12.6, 24.2]     12
(0.999, 12.6]    12
(24.2, 35.8]     11
dtype: int64

In [30]:
stackoverflow['Age'].describe()

count    999.000000
mean      36.003003
std       13.255127
min       18.000000
25%       25.000000
50%       35.000000
75%       45.000000
max       83.000000
Name: Age, dtype: float64

In [28]:
pd.cut(stackoverflow['Age'],4).value_counts()

(17.935, 34.25]    477
(34.25, 50.5]      376
(50.5, 66.75]      125
(66.75, 83.0]       21
Name: Age, dtype: int64

In [29]:
pd.qcut(stackoverflow['Age'],4).value_counts()

(17.999, 25.0]    266
(35.0, 45.0]      249
(25.0, 35.0]      247
(45.0, 83.0]      237
Name: Age, dtype: int64

In [31]:
pd.cut(stackoverflow['Age'],3).value_counts()

(17.935, 39.667]    616
(39.667, 61.333]    340
(61.333, 83.0]       43
Name: Age, dtype: int64

In [32]:
pd.qcut(stackoverflow['Age'],3).value_counts()

(17.999, 29.0]    349
(29.0, 42.0]      329
(42.0, 83.0]      321
Name: Age, dtype: int64

In [51]:
pd.cut(stackoverflow['ConvertedSalary'],5).value_counts()

(-2000.0, 400000.0]       645
(800000.0, 1200000.0]       9
(400000.0, 800000.0]        6
(1600000.0, 2000000.0]      5
(1200000.0, 1600000.0]      0
Name: ConvertedSalary, dtype: int64

In [52]:
pd.qcut(stackoverflow['ConvertedSalary'],5).value_counts()

(67620.8, 100000.0]      135
(44062.4, 67620.8]       133
(20695.2, 44062.4]       133
(-0.001, 20695.2]        133
(100000.0, 2000000.0]    131
Name: ConvertedSalary, dtype: int64

In [56]:
# Import numpy
import numpy as np

# Specify the boundaries of the bins
bins = [-np.inf, 10000, 50000, 100000, 150000, np.inf]

# Bin labels
labels = ['Very low', 'Low', 'Medium', 'High', 'Very high']

# Bin the continuous variable ConvertedSalary using these boundaries
stackoverflow['boundary_binned'] = pd.cut(stackoverflow['ConvertedSalary'], 
                                         bins, labels = labels)

# Print the first 5 rows of the boundary_binned column
print(stackoverflow[['boundary_binned', 'ConvertedSalary']].head())

  boundary_binned  ConvertedSalary
0             NaN              NaN
1          Medium          70841.0
2             NaN              NaN
3             Low          21426.0
4             Low          41671.0